# Taps
## for borders
tap "FelixKratz/formulae"
tap "eddieantonio/eddieantonio"
tap "graalvm/tap"
tap "koekeishiya/formulae"
tap "streetpea/streetpea"

# Brew apps
brew "borders"
brew "chezmoi"
brew "docker"
brew "figlet"
brew "git"
brew "git-lfs"
brew "go"
# imgcat
brew "eddieantonio/eddieantonio/imgcat"
brew "kcat"
brew "mosh"
brew "node"
# pipx to run python app in isolated env
brew "pipx"
brew "rustup"
# shkd to launch app using shortcut keys
brew "koekeishiya/formulae/skhd"
brew "tmux"
# sloth to show list of opened/locked files
brew "sloth"
# yabai only used to help listing window within space
brew "koekeishiya/formulae/yabai"
# yt-dlp to download youtube or videos (youtube-dl no longer maintained)
brew "yt-dlp"

# Casks
cask "1password"
cask "adguard"
# chiaki-ng to play PS5
cask "chiaki-ng"
cask "commandq"
cask "contexts"
# detectx-swift to find and clean up malware: https://sqwarq.wordpress.com/detectx/
cask "detectx-swift"
cask "devutils"
cask "graalvm/tap/graalvm-community-jdk21"
# ice (bartender alternative)
cask "jordanbaird-ice"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keepingyouawake"
# kitty is alternative to iterm2
cask "kitty"
# knockknock to see persistent files installed: https://objective-see.org/products/knockknock.html
cask "knockknock"
# licecap for screen capture
cask "licecap"
# lunar is for managing multiple displays
# cask "lunar"
cask "menumeters"
# Multitouch overlaps with Rectangle, paid and better version
# Disable shortcut for window management - only use this for track/mouse
# No gap settings yet
cask "multitouch"
cask "nimble-commander"
cask "obsidian"
# omnidisksweeper for cleaning up storage
cask "omnidisksweeper"
# pearcleaner for cleanup post-app installation
cask "pearcleaner"
cask "postman"
# rancher is docker desktop ui alternative
cask "rancher"
# rectangle for window management, keep until multitouch support gap settings
cask "rectangle"
cask "spotify"
cask "streetpea/streetpea/chiaki-ng"
cask "sublime-text"
cask "tailscale"
cask "temurin"
# transmission for torrent client
cask "transmission"
cask "visual-studio-code"
cask "visualvm"
cask "wireshark"
cask "zed"
cask "zoom"



# App Store apps
## Others
mas "AutoMounter", id: 1160435653
mas "Day One", id: 1055511498
mas "GeoTag", id: 1465180184
mas "Goodnotes", id: 1444383602
mas "Micro Snitch", id: 972028355
mas "MindNode", id: 1289197285
mas "MoneyWiz", id: 1511185140
mas "Overlap", id: 1516950324
mas "Simple Comic", id: 1497435571
mas "The Unarchiver", id: 425424353
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835

## Messaging
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997

## Safari extensions
mas "1Password for Safari", id: 1569813296
mas "JSONPeep", id: 1458969831
mas "OneTab", id: 1540160809
mas "PiPifier", id: 1160374471
